src/Catalogs/Вещи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вещи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВещей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВещей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеФото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияСервисныйЦентр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантийныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/МестонахождениеВещей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеВещей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вещь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыВещейИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВещейИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВещей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вещь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вещи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыВещей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыВещей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хранится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбыло</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Вещи/Ext/ObjectModule.bsl
// Вещь: предмет, которым владеете (METADATA §2.4).
// Место, дом и статус — текущие значения в самой вещи; их историю пишут события
// записи объекта в регистры МестонахождениеВещей и СтатусыВещейИстория (T-015).

Перем НоваяЗапись;               // признак новой записи между ПередЗаписью и ПриЗаписи
Перем ИзменилосьМестонахождение; // изменились ли место или дом относительно базы
Перем ИзменилсяСтатус;           // изменился ли статус относительно базы

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Статус = Перечисления.СтатусыВещей.Используется;
	Место = Вещи.ПоследнееМесто();
	Если Место.Пустая() Тогда
		ОбъектНедвижимости = Дома.ДомПоУмолчанию();
	Иначе
		ОбъектНедвижимости = Место.Владелец;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ПустаяСтрока(Наименование) Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Укажите название — без него вещь не найти в поиске.'"),
			"Наименование");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	НоваяЗапись = ЭтоНовый();

	Если НЕ ОбменДанными.Загрузка Тогда
		// Дом вещи всегда совпадает с домом её места.
		Если НЕ Место.Пустая() Тогда
			ОбъектНедвижимости = Место.Владелец;
		КонецЕсли;
		ЗаполнитьГарантию();
		ЗапомнитьИзменения();
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если НЕ ОбменДанными.Загрузка Тогда
		Если ИзменилосьМестонахождение Тогда
			ЗаписатьМестонахождение();
		КонецЕсли;
		Если ИзменилсяСтатус Тогда
			ЗаписатьСтатус();
		КонецЕсли;
		// Источник перемещений и статусов — сама вещь: пересобираем её события целиком.
		Если ИзменилосьМестонахождение Или ИзменилсяСтатус Тогда
			Хроника.ОбновитьПоИсточнику(Ссылка, Вещи.СобытияВещи(Ссылка));
		КонецЕсли;
		// События покупки и документов содержат дом вещи: после смены дома их пересобираем.
		Если ИзменилосьМестонахождение Тогда
			Вещи.ОбновитьСобытияПокупки(Ссылка);
			Вложения.ОбновитьСобытияПоПредмету(Ссылка);
		КонецЕсли;
		Если НЕ Место.Пустая() Тогда
			Вещи.ЗапомнитьПоследнееМесто(Место);
		КонецЕсли;
		Вещи.ОбновитьПокупку(Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сравнивает место, дом и статус с сохранёнными в базе. У новой вещи ссылка ещё
// пустая, поэтому изменением считается любое заполненное значение.
Процедура ЗапомнитьИзменения()

	Если НоваяЗапись Тогда
		ИзменилосьМестонахождение = НЕ Место.Пустая() ИЛИ НЕ ОбъектНедвижимости.Пустая();
		ИзменилсяСтатус = НЕ Статус.Пустая();
		Возврат;
	КонецЕсли;

	Сохранённые = СохранённыеЗначения();
	Если Сохранённые = Неопределено Тогда
		// Запись исчезла из базы между чтением и записью: историю не пишем.
		ИзменилосьМестонахождение = Ложь;
		ИзменилсяСтатус = Ложь;
	Иначе
		ИзменилосьМестонахождение = Сохранённые.Место <> Место
			ИЛИ Сохранённые.ОбъектНедвижимости <> ОбъектНедвижимости;
		ИзменилсяСтатус = Сохранённые.Статус <> Статус;
	КонецЕсли;

КонецПроцедуры

// Место, дом и статус существующей вещи по ссылке.
Функция СохранённыеЗначения()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Вещи.Место КАК Место,
	|	Вещи.ОбъектНедвижимости КАК ОбъектНедвижимости,
	|	Вещи.Статус КАК Статус
	|ИЗ
	|	Справочник.Вещи КАК Вещи
	|ГДЕ
	|	Вещи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Место, ОбъектНедвижимости, Статус",
			Выборка.Место, Выборка.ОбъектНедвижимости, Выборка.Статус);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Добавляет запись истории местонахождения. Две записи одной вещи в одну секунду
// перезапишут друг друга — это допустимо (T-015).
Процедура ЗаписатьМестонахождение()

	Запись = РегистрыСведений.МестонахождениеВещей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Вещь = Ссылка;
	Запись.ОбъектНедвижимости = ОбъектНедвижимости;
	Запись.Место = Место;
	ЗаметкаИстории = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЗаметкаИстории", ЗаметкаИстории) Тогда
		Запись.Заметка = ЗаметкаИстории;
	КонецЕсли;
	Запись.Записать(Истина);

КонецПроцедуры

// Добавляет запись истории статуса; перезапись в одну секунду — как у местонахождения.
Процедура ЗаписатьСтатус()

	Запись = РегистрыСведений.СтатусыВещейИстория.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Вещь = Ссылка;
	Запись.Статус = Статус;
	ЗаметкаИстории = Неопределено;
	Если ДополнительныеСвойства.Свойство("ЗаметкаИстории", ЗаметкаИстории) Тогда
		Запись.Заметка = ЗаметкаИстории;
	КонецЕсли;
	Запись.Записать(Истина);

КонецПроцедуры

// Дозаполняет гарантию при записи (ADR-008): начало по умолчанию — дата покупки,
// окончание считается из начала и срока. Введённое вручную окончание не перетирается.
Процедура ЗаполнитьГарантию()

	Если НЕ ЗначениеЗаполнено(ГарантияНачало) И ЗначениеЗаполнено(ДатаПокупки) Тогда
		ГарантияНачало = ДатаПокупки;
	КонецЕсли;
	Если ЗначениеЗаполнено(ГарантияМесяцев) И НЕ ЗначениеЗаполнено(ГарантияОкончание) Тогда
		ГарантияОкончание = ВещиКлиентСервер.ОкончаниеГарантии(ГарантияНачало, ГарантияМесяцев);
	КонецЕсли;

КонецПроцедуры

Процедура СообщитьПользователю(Текст, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
